In [1]:
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.DataFrame({
    'P Cost': [50,50,50,50,75,100,100],
    'P Views': [20000, 15000, 23000, 20000, 19000, 30000, 40000],
    'Q Cost': [150, 150, 150, 150, 200, 300, 300],
    'Q Views': [200000, 210000, 175000, 230000, 150000, 500000, 450000],
    'R Cost': [50,50,50,50,75,100,100],
    'R Views': [10000, 20000, 20000, 14000, 23000, 22000, 25000]
}, index= ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'])
df

           P Cost  P Views  Q Cost  Q Views  R Cost  R Views
Monday         50    20000     150   200000      50    10000
Tuesday        50    15000     150   210000      50    20000
Wednesday      50    23000     150   175000      50    20000
Thursday       50    20000     150   230000      50    14000
Friday         75    19000     200   150000      75    23000
Saturday      100    30000     300   500000     100    22000
Sunday        100    40000     300   450000     100    25000

In [3]:
df.describe()

,P Cost,P Views,Q Cost,Q Views,R Cost,R Views
count,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000
mean,67.857143,23857.142857,200.000000,273571.428571,67.857143,19142.857143
std,23.779743,8474.050024,70.710678,140674.396086,23.779743,5304.984179
min,50.000000,15000.000000,150.000000,150000.000000,50.000000,10000.000000
25%,50.000000,19500.000000,150.000000,187500.000000,50.000000,17000.000000
50%,50.000000,20000.000000,150.000000,210000.000000,50.000000,20000.000000
75%,87.500000,26500.000000,250.000000,340000.000000,87.500000,22500.000000
max,100.000000,40000.000000,300.000000,500000.000000,100.000000,25000.000000

In [4]:
df.sum()

P Cost         475
P Views     167000
Q Cost        1400
Q Views    1915000
R Cost         475
R Views     134000
dtype: int64

In [5]:
df[['P Cost', 'Q Cost', 'R Cost']].mean(axis=1)

Monday        83.333333
Tuesday       83.333333
Wednesday     83.333333
Thursday      83.333333
Friday       116.666667
Saturday     166.666667
Sunday       166.666667
dtype: float64

In [6]:
df.to_csv("newspaper_prices.csv", index = False)

In [7]:
dates = pd.date_range('2018-01', periods=200, freq='D')

In [8]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-07-10', '2018-07-11', '2018-07-12', '2018-07-13',
               '2018-07-14', '2018-07-15', '2018-07-16', '2018-07-17',
               '2018-07-18', '2018-07-19'],
              dtype='datetime64[ns]', length=200, freq='D')

In [9]:
ads = pd.read_csv("Advertising.csv", )

In [10]:
ads.count()

Date         200
TV           200
newspaper    200
radio        200
sales        200
dtype: int64

In [11]:
ads.head()

         Date           TV   newspaper       radio       sales
0  2018-01-01  230100000.0  69200000.0  37800000.0  22100000.0
1  2018-01-02   44500000.0  45100000.0  39300000.0  10400000.0
2  2018-01-03   17200000.0  69300000.0  45900000.0   9300000.0
3  2018-01-04  151500000.0  58500000.0  41300000.0  18500000.0
4  2018-01-05  180800000.0  58400000.0  10800000.0  12900000.0

In [12]:
ads['TV'].values

array([2.301e+08, 4.450e+07, 1.720e+07, 1.515e+08, 1.808e+08, 8.700e+06,
       5.750e+07, 1.202e+08, 8.600e+06, 1.998e+08, 6.610e+07, 2.147e+08,
       2.380e+07, 9.750e+07, 2.041e+08, 1.954e+08, 6.780e+07, 2.814e+08,
       6.920e+07, 1.473e+08, 2.184e+08, 2.374e+08, 1.320e+07, 2.283e+08,
       6.230e+07, 2.629e+08, 1.429e+08, 2.401e+08, 2.488e+08, 7.060e+07,
       2.929e+08, 1.129e+08, 9.720e+07, 2.656e+08, 9.570e+07, 2.907e+08,
       2.669e+08, 7.470e+07, 4.310e+07, 2.280e+08, 2.025e+08, 1.770e+08,
       2.936e+08, 2.069e+08, 2.510e+07, 1.751e+08, 8.970e+07, 2.399e+08,
       2.272e+08, 6.690e+07, 1.998e+08, 1.004e+08, 2.164e+08, 1.826e+08,
       2.627e+08, 1.989e+08, 7.300e+06, 1.362e+08, 2.108e+08, 2.107e+08,
       5.350e+07, 2.613e+08, 2.393e+08, 1.027e+08, 1.311e+08, 6.900e+07,
       3.150e+07, 1.393e+08, 2.374e+08, 2.168e+08, 1.991e+08, 1.098e+08,
       2.680e+07, 1.294e+08, 2.134e+08, 1.690e+07, 2.750e+07, 1.205e+08,
       5.400e+06, 1.160e+08, 7.640e+07, 2.398e+08, 7.530e+07, 6.840e+07,
       2.135e+08, 1.932e+08, 7.630e+07, 1.107e+08, 8.830e+07, 1.098e+08,
       1.343e+08, 2.860e+07, 2.177e+08, 2.509e+08, 1.074e+08, 1.633e+08,
       1.976e+08, 1.849e+08, 2.897e+08, 1.352e+08, 2.224e+08, 2.964e+08,
       2.802e+08, 1.879e+08, 2.382e+08, 1.379e+08, 2.500e+07, 9.040e+07,
       1.310e+07, 2.554e+08, 2.258e+08, 2.417e+08, 1.757e+08, 2.096e+08,
       7.820e+07, 7.510e+07, 1.392e+08, 7.640e+07, 1.257e+08, 1.940e+07,
       1.413e+08, 1.880e+07, 2.240e+08, 1.231e+08, 2.295e+08, 8.720e+07,
       7.800e+06, 8.020e+07, 2.203e+08, 5.960e+07, 7.000e+05, 2.652e+08,
       8.400e+06, 2.198e+08, 3.690e+07, 4.830e+07, 2.560e+07, 2.737e+08,
       4.300e+07, 1.849e+08, 7.340e+07, 1.937e+08, 2.205e+08, 1.046e+08,
       9.620e+07, 1.403e+08, 2.401e+08, 2.432e+08, 3.800e+07, 4.470e+07,
       2.807e+08, 1.210e+08, 1.976e+08, 1.713e+08, 1.878e+08, 4.100e+06,
       9.390e+07, 1.498e+08, 1.170e+07, 1.317e+08, 1.725e+08, 8.570e+07,
       1.884e+08, 1.635e+08, 1.172e+08, 2.345e+08, 1.790e+07, 2.068e+08,
       2.154e+08, 2.843e+08, 5.000e+07, 1.645e+08, 1.960e+07, 1.684e+08,
       2.224e+08, 2.769e+08, 2.484e+08, 1.702e+08, 2.767e+08, 1.656e+08,
       1.566e+08, 2.185e+08, 5.620e+07, 2.876e+08, 2.538e+08, 2.050e+08,
       1.395e+08, 1.911e+08, 2.860e+08, 1.870e+07, 3.950e+07, 7.550e+07,
       1.720e+07, 1.668e+08, 1.497e+08, 3.820e+07, 9.420e+07, 1.770e+08,
       2.836e+08, 2.321e+08])

In [13]:
df = pd.DataFrame({
    "TV": ads.TV.values*1000,
    "radio": ads.radio.values*1000,
    "newspaper": ads.newspaper.values*1000,
    "sales": ads.sales.values*1000
}, index = dates)

In [14]:
df

                      TV         radio     newspaper         sales
2018-01-01  2.301000e+11  3.780000e+10  6.920000e+10  2.210000e+10
2018-01-02  4.450000e+10  3.930000e+10  4.510000e+10  1.040000e+10
2018-01-03  1.720000e+10  4.590000e+10  6.930000e+10  9.300000e+09
2018-01-04  1.515000e+11  4.130000e+10  5.850000e+10  1.850000e+10
2018-01-05  1.808000e+11  1.080000e+10  5.840000e+10  1.290000e+10
...                  ...           ...           ...           ...
2018-07-15  3.820000e+10  3.700000e+09  1.380000e+10  7.600000e+09
2018-07-16  9.420000e+10  4.900000e+09  8.100000e+09  9.700000e+09
2018-07-17  1.770000e+11  9.300000e+09  6.400000e+09  1.280000e+10
2018-07-18  2.836000e+11  4.200000e+10  6.620000e+10  2.550000e+10
2018-07-19  2.321000e+11  8.600000e+09  8.700000e+09  1.340000e+10

[200 rows x 4 columns]